### 1 Handling missing value

Missing values are usually denot by NaN

In [4]:
import numpy as np 
import pandas as pd

In [5]:
srs=pd.Series([1,2,np.nan,3,np.nan])
srs

0    1.0
1    2.0
2    NaN
3    3.0
4    NaN
dtype: float64

In [6]:
srs.isnull()

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [7]:
srs.fillna(0)

0    1.0
1    2.0
2    0.0
3    3.0
4    0.0
dtype: float64

In [8]:
srs.dropna()

0    1.0
1    2.0
3    3.0
dtype: float64

In [14]:
srs[srs.notnull()]  #similar to drpona

0    1.0
1    2.0
3    3.0
dtype: float64

##### Filtering Out Missing Data

In [16]:
from numpy import nan as NA
df= pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])
df

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

With DataFrame objects, things are a bit more complex. You may want to drop rows
or columns that are all NA or only those containing any NAs. dropna by default drops
any row containing a missing value:

In [17]:
df.dropna()

     0    1    2
0  1.0  6.5  3.0

Passing how='all' will only drop rows that are all NA:

In [20]:
df.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

To drop column wise

In [21]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [23]:
df.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [25]:
df[4]=NA
df

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [26]:
df.dropna(axis='columns',how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [30]:
df=pd.DataFrame(np.random.randn(7,3))
df

          0         1         2
0  1.013127  1.145026  1.152360
1 -0.137570  0.235661  0.768951
2  0.181335 -1.455382  0.078245
3  0.607597  0.063055  0.391401
4 -0.163306 -1.552267  0.214953
5 -0.004350  1.142723  2.158058
6  0.364670  0.284327 -0.301911

In [32]:
df.iloc[:4,1]=NA
df.iloc[:2,2]=NA
df

          0         1         2
0  1.013127       NaN       NaN
1 -0.137570       NaN       NaN
2  0.181335       NaN  0.078245
3  0.607597       NaN  0.391401
4 -0.163306 -1.552267  0.214953
5 -0.004350  1.142723  2.158058
6  0.364670  0.284327 -0.301911

In the dropna method of a Pandas DataFrame, the thresh parameter is used to specify a threshold for the number of non-null values. This parameter determines the minimum number of non-null values required for a row or column to be retained after calling dropna.

In [33]:
df.dropna(thresh=2)

          0         1         2
2  0.181335       NaN  0.078245
3  0.607597       NaN  0.391401
4 -0.163306 -1.552267  0.214953
5 -0.004350  1.142723  2.158058
6  0.364670  0.284327 -0.301911

#### Filling in missing data